say_hello = 'Тілді таңдаңыз\nВыберите язык'

choose_kz = 'Ережені жүктеу'

choose_ru = 'Скачать положение'

alippe_txt = f'Bilgen Әліппе әлемін бірге саяхаттауға шақырамыз❗️\n' \
             f'Bilgen Әліппе оқулығы оқылым, жазылым, айтылым және тыңдалым — 4 дағды бойынша жүргізіледі.\n' \
             f'Танымдық әрі қызықты бұл оқулық өз оқырманын бірден баурап алатыны сөзсіз💯✔️ ' \
             f'Себебі оқулықтың мобильді нұсқасы бар. ' \
             f'Ал саяхаттың мазмұнды да әсерлі өтуіне Bilge Bala мен Айкерім көмектеседі. \n\n' \
             f'Әліппе әлемін бірге тамашалағыңыз келсе, тапсырыс беріңіз.\n\n' \
             f'Бағасы: 3 500 kzt'

mistake = 'Введен не корректный запрос, нажмите на кнопку из нижеперечисленных\n\n' \
          'Дұрыс емес сұрау енгізілді, төменде көрсетілгендерден батырмасын басыңыз'

enter_the_number_text = 'Телефон нөміріңізді теріңіз\nНемесе "Байланыс нөмірімен бөлісу" батырмасын басыңыз\n\n' \
                        'Введите номер телефона\nИли нажмите на кнопку "Поделиться контактом"' \
                        '\n\nМысалы/Например:\n87771112233'

iin_pattern = r'[0-9]{12}'

fio_pattern = r'(([A-Za-zА-ЯЁа-яёӘәІіҢңҒғҮүҰұҚқӨөҺһ]+ [A-Za-zА-ЯЁа-яёӘәІіҢңҒғҮүҰұҚқӨөҺһ]+' \
              r'(\-[A-Za-zА-ЯЁа-яёӘәІіҢңҒғҮүҰұҚқӨөҺһ]+)*)' \
              r'( [A-Za-zА-ЯЁа-яёӘәІіҢңҒғҮүҰұҚқӨөҺһ]+)?)'

phone_number_pattern = r'((8|7)[\d]{10})|(\+7[\d]{10})'
#######################################################################################################################
tanymger_kz = 'Tanymger Expert – заманауи электронды оқулық жасау бойынша авторлар мен баспа қызметкерлерінің ' \
              'біліктілігін арттыру курсы.'

tech_teach_kz = 'Tanymger Tech – информатика пәні мұғалімдеріне арналған курс.'

oys_kz = 'Oysana – менталды арифметика курсы.'

tog_kz = 'Тоғызқұмалақ – дене шынықтыру мамандарына "Тоғызқұмалақ" ұлттық ойынын үйрету.'

techr_kz = 'Білікті педагог – мұғалімдердің біліктілігін арттыру олимпиадасы.'


tanymger_kz_path = './condition_kz/teacher/Tanymger Expert.docx'

tech_kz_path = 'condition_kz/teacher/Tanymger Tech.pdf'

oys_kz_path = './condition_kz/teacher/BilGen Oysana.pdf'

tog_kz_path = './condition_kz/teacher/Тогызкумалак.pdf'

techr_kz_path = './condition_kz/teacher/Білікті педагог.pdf'


info_1_str = f'{tanymger_kz}\n\n{tech_teach_kz}\n\n{tog_kz}'

info_1_2_str = f'{tech_teach_kz}\n\n{techr_kz}'
#######################################################################################################################


#######################################################################################################################
tanymger_ru = 'Tanymger  Expert – курс повышения квалификации для авторов и сотрудников издании ' \
              'по разработке электронного учебника.'

tech_teach_ru = 'Tanymger Tech – курс для учителей информатики.'

tog_ru = 'Тоғызқұмалақ – обучение учителей физкультуры национальной игре «Тогызкумалак».'

techr_ru = 'Квалифицированный педагог – олимпиада для повышения квалификации учителей.'

info_4_str = f'{tanymger_ru}\n\n{tech_teach_ru}\n\n{tog_ru}'

info_4_2_str = f'{tech_teach_ru}\n\n{techr_ru}'

tanymger_ru_path = 'condition_ru/teacher/Tanymger Expert.docx'

tech_ru_path = './condition_ru/teacher/Tanymger Tech.pdf'

tog_ru_path = './condition_ru/teacher/Тогызкумалак.pdf'

techr_ru_path = 'condition_ru/teacher/Квалифицированный педагог.pdf'

#######################################################################################################################


#######################################################################################################################
ubt_kz = 'Bilgen UBT – 10-11 сынып оқушыларын таңдау пәні бойынша ҰБТ-ға дайындау курсы.'

baige_kz = '«Bilgen Baige» бастауыш сынып оқушыларына, «Bilgen Alaman» жоғарғы сынып оқушыларына арналған ' \
           'пәндік олимпиадалар.'

bilik_kz = 'Bala/Bilik Time – Бастауыш пен жоғарғы сыныптар арасында республикалық көлемде өтетін онлайн олимпиадалар.'

tech_kz = 'Bilgen Tech – IT саласы бойынша бағдарламалау курсы.'

bilgen_sprint_txt_kz = 'Bilgen Sprint - Республикалық қашықтықтан өткізілетін пәндік олимпиада'

ubt_kz_path = './condition_kz/student/BilGen UBT.pdf'

baige_kz_path = './condition_kz/student/BilGen Baige, BilGen Alaman.pdf'

bilik_kz_path = './condition_kz/student/BilGen Bala, Bilik TIME.pdf'

bilgen_sprint_path_kz = './condition_kz/student/BilGen Sprint.pdf'

bilgen_tech_path = './condition_kz/student/BilGenTech.pdf'

info_2_str = f'{ubt_kz}\n\n{tech_kz}'

info_3_str = f'{baige_kz}\n\n{bilik_kz}\n\n{bilgen_sprint_txt_kz}'
#######################################################################################################################


#######################################################################################################################
baige_ru = 'Предметные олимпиады для учеников младших классов «Bilgen Baige» и старшеклассников «Bilgen Alaman».'

bilik_ru = 'Bala/Bilik Time – Республиканские онлайн-олимпиады для учеников 1-11 классов.'

tech_ru = 'Bilgen Tech – курс программирования.'

bilgen_sprint_txt_ru = 'Bilgen Sprint - Республиканская дистанционная предметная олимпиада'

doda_inf_kz = 'Doda - Бастауыш сынып оқушыларына арналған Республикалық "Doda" шығармашылық байқауы'
doda_inf_ru = 'Doda - Республиканский дистанционный творческий конкурс для учащихся начальных классов'

doda_path_kz = './condition_kz/student/Doda.pdf'
doda_path_ru = './condition_ru/student/Doda.pdf'

baige_ru_path = 'condition_ru/student/BilGen Baige, BilGen Alaman.pdf'

bilik_ru_path = './condition_ru/student/BilGen Bala, Bilik TIME.pdf'

bilgen_sprint_path_ru = './condition_ru/student/BilGen Sprint.pdf'

info_5_str = f'{tech_ru}'

info_6_str = f'{baige_ru}\n\n{bilik_ru}\n\n{bilgen_sprint_txt_ru}'
#######################################################################################################################

#######################################################################################################################
tanymger_expert_kz = 'Tanymger Expert'
tanymger_tech_kz = 'Tanymger Tech'
oysana_kz = 'Oysana'
togyzqumalaq_kz = 'Тоғызқұмалақ'
pedagog_kz = 'Білікті педагог'

tanymger_expert_ru = 'Tanymger  Expert'
tanymger_tech_ru = 'Tanymger  Tech'
togyzqumalaq_ru = 'Toғызқұмалақ'
pedagog_ru = 'Квалифицированный педагог'

bilgen_tech_kz = 'Bilgen Tech'
bilgen_ubt_kz = 'Bilgen UBT'
bilgen_baige_kz = 'Bilgen Baige/Alaman'
bala_time_kz = 'Bala/Bilik Time'
sprint_kz = 'Bilgen Sprint'

bilgen_tech_ru = 'Bilgen  Tech'
bilgen_baige_ru = 'Bilgen  Baige/Alaman'
bala_time_ru = 'Bala/Bilik  Time'
sprint_ru = 'Bilgen  Sprint'

matem = 'Естественно-математическое'
gum = 'Общественно-гуманитарное'
mat_kz = 'Жаратылыстану-математикалық'
gum_kz = 'Қоғамдық-гуманитарлық'

doda_dir_lan_kz = 'Тіл білімі'
doda_dir_log_kz = 'Логика'
doda_ru = 'Doda'
doda_kz = 'Dodа' # 'a' rus
doda_dir_lan_ru = 'Лингвистика'
doda_dir_log_ru = 'Логикa' # 'a' - eng
#######################################################################################################################

